libxmlbus/data/wsaddr-testset/documents/echo/soap11/noActionRequest.xml

<?xml version="1.0"?>
<!-- $Id: noActionRequest.xml,v 1.4 2006/02/20 16:01:17 pdowney Exp $ -->
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap11:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:MessageID>urn:uuid:A6332C1B-1469-4448-A860-71059F20C111</wsa:MessageID>
  </soap11:Header>
  <soap11:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap11:Body>
</soap11:Envelope>
